map_dict = {'лизиноприл':'л.з.....ил|лизитар|лизинеоприл', 
                  'цефтриаксон':'три.....ф|цефт.....он|цефтриакосн', 
                   "метопролол":"мет.....ол|эгилок", 
                  "фраксипарин":"фра......ин",
                  'тейкопланин': "тей......ин.",
                  "амброксол": "аброкол|амброко.|амб......|амброксолс\
                      |амброкосл|амброксолл|амброксолл|аброксол|амброксолл", 
                  "моксифлоксацин": 'пле....кс.|мокс.......цин',
                  "молсидомин":"м.лсид...н",
                  "спиронолактон":"сп.р.......он.|верош....н",
                 "бисопролол":"б.с.пр..ол|бисопралдол|бикард|конкор", 
                  "лансопрозол": "лан......ол|ланс.зол",
                 "меропенем":"мер....ем",
                  "аторвастатин": "липромак|аторв.......",
                 "дексаметазон": "декс.......н|дексаетазон",
                 "левофлоксацин": "лев.......цин",
                 "омепразол": "омез|омепр..ол",
                 "азитромицин": "азит.......",
                 "кандесартан": "к.с.рк",
                 "амоксициллин": "амоксицилин|амо........н",
                 "озельтамивир": "флустоп|озел.......р",
                 "эноксапарин": "клексан|кл...ан",
                 "имепенем": "им....ем",
                 "клопидогрел": "клопидогрель|плавикс|клорпидогрель",
                 "аспикард": "аспкиард|кардиомагнил|ас....рд",
                 "амлодипин":"амл....ин",
                 "амикацин": "ам.к...н",
                 "индапамид": "индап|инд.....д",
                 "беродуал": "бер.дуал|ипратропия.бромид",
                 "ацетилцистеин": "ацецемед|асс|ацц|ацемед|ацецезон",
                 "парацетамол": "парац.....л",
                 "гидроксихлорохин": "плаквенил|имар.|иммар.",
                 "метилпреднизолон": "медрол|м.дрол|метипред|диметилпреднизолон",
                 "теофиллин": "теофилин|теотард|теофилл",
                 "кларитромицин": "кларибацин|кла.......цин",
                 "лозартан": "лазртан|л...ртан|л.риста",
                 "валсартан": "валозартан|валз|вал....ан",
                 "моксонидин": "м.кс.н.дин",
                 "амиодарон": "ами.д.р.н|к.рд.рон",
                 "полимиксин": "колистин|колистат|к.л.стат",
                 "преднизолон": "преднезолон|пре.н.з.лон",
                 "рамиприл": "рам.л...|рам.прил",
                 "карбомазепин": "карб.м.з.п.н",
                 "кетаролак": "кет.р.лак|кет.рол|кет.н.в",
                 "гентамицин": "г.нт.мицин",
                 "цефепим": "ц.ф.пим",
                 "цефоперазон/сульбактам": "цеф.пер.зон|цеф.пер.зон.су.......",
                 "тайгециклин": "тиг.циклин|та.г.циклин",
                 "зопиклон": "з.п.клон|соне.|соне.с",
            "лейкоциты":"лейк.|лейкоц.|лейк|лейкоц|лейк...т",
            "аланинаминрансфераза": "alt|алт|алат",
            "аспартатаминрансфераза": "ast|аст|асат",
            "креатинин":"креат.|креатин.|креат...н"
           }

cleaned_treatment = []
for words in tr:
    try:
        for i, j in dict_treatment.items():
            words = re.sub(j, i, words.lower())

        cleaned_treatment.append(words)
    except:
        cleaned_treatment.append("None")
